In [2]:
#import a library
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [5]:
def create_server_connection(host_name,user_name,user_password):
    connection=None
    try:
        connection=mysql.connector.connect(host=host_name,
                                           user=user_name,
                                           password=user_password
                                           )
        print('Mysql Database connection successful')
    except Error as err:
        print(f"'Error:'{err}'")
    return connection

#put our MySQL Terminal password
pw='Kamble@123'
#database_name
db_name='mysql_python'
Connection=create_server_connection('localhost','root',pw)

Mysql Database connection successful

In [7]:
#pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\asus\appdata\local\programs\python\python312\lib\site-packages (8.4.0)
Note: you may need to restart the kernel to use updated packages.

In [12]:
#create mysql_python
#create database mysql_python;
def create_database(Connection,query):
    cursor=Connection.cursor()
    try:
        cursor.execute(query)
        print('Database create successfully')
    except Error as err:
        print(f'Error:{err}')
create_database_query="Create database mysql_python"
create_database(Connection,create_database_query)

Error:1007 (HY000): Can't create database 'mysql_python'; database exists

In [13]:
#connect to database
#use mysql_python;
def create_db_connection(host_name,user_name,user_password,db_name):
    Connection=None
    try:
        Connection=mysql.connector.connect(
           host=host_name,
           user=user_name,
           passwd=user_password,
           database=db_name
            
        )
        print('Mysql database connection successful')
    except Error as err:
        print(f"Error:{err}")
    return Connection

In [17]:
#Execute sql queries
def execute_query(Connection,query):
    cursor=Connection.cursor()
    try:
        cursor.execute(query)
        Connection.commit()
        print('Query was successful')
    except Error as err:
        print(f"Error:{err}")

In [19]:
create_orders_table="""
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));"""

#connect to the database
Connection=create_db_connection("localhost","root",pw,db_name)
execute_query(Connection,create_orders_table)

Mysql database connection successful
Query was successful

In [21]:
#insert data
data_orders="""
insert into orders values (101,'Steve','Laptop','2018-06-12',2,800,'3425241235'),

(102,'Jos','Laptop','2019-02-10',10,12,'3425241235'),
(103,'Stacy','Books','2019-12-25',5,50,'3425241235'),
(104,'Nancy','Trousers','2018-07-14',7,30,'3425241235'),
(105,'Maria','T-shirts','2019-05-30',6,48,'3425241235'),
(106,'Danny','Smart TV','2018-08-20',10,300,'3425241235')
"""
Connection=create_db_connection("localhost","root",pw,db_name)
execute_query(Connection,data_orders)

Mysql database connection successful
Query was successful

In [22]:
def read_query(connection,query):
    cursor=connection.cursor()
    result=None
    try:
        cursor.execute(query)
        result=cursor.fetchall()
        return result
    except Error as err:
        print(f"Error:{err}")

In [24]:
#Using the select statement
q1=""" Select*from orders"""
Connection=create_db_connection("localhost","root",pw,db_name)
results=read_query(Connection,q1)
for result in results:
    print(result)

Mysql database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '3425241235')
(102, 'Jos', 'Laptop', datetime.date(2019, 2, 10), 10, 12.0, '3425241235')
(103, 'Stacy', 'Books', datetime.date(2019, 12, 25), 5, 50.0, '3425241235')
(104, 'Nancy', 'Trousers', datetime.date(2018, 7, 14), 7, 30.0, '3425241235')
(105, 'Maria', 'T-shirts', datetime.date(2019, 5, 30), 6, 48.0, '3425241235')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '3425241235')

In [27]:
#Using the select statement
q2=""" Select customer_name,phone_number from orders"""
Connection=create_db_connection("localhost","root",pw,db_name)
results=read_query(Connection,q2)
for result in results:
    print(result)

Mysql database connection successful
('Steve', '3425241235')
('Jos', '3425241235')
('Stacy', '3425241235')
('Nancy', '3425241235')
('Maria', '3425241235')
('Danny', '3425241235')

In [29]:
q3="""
select year(date_ordered) from orders;"""

Connection=create_db_connection("localhost","root",pw,db_name)
results=read_query(Connection,q3)
for result in results:
    print(result)

Mysql database connection successful
(2018,)
(2019,)
(2019,)
(2018,)
(2019,)
(2018,)

In [31]:
q4="""
select distinct year(date_ordered) from orders;"""

Connection=create_db_connection("localhost","root",pw,db_name)
results=read_query(Connection,q4)
for result in results:
    print(result)

Mysql database connection successful
(2018,)
(2019,)

In [36]:
q5="select * from orders where date_ordered>'2018-12-31' "
results=read_query(Connection,q5)
for result in results:
    print(result)

(102, 'Jos', 'Laptop', datetime.date(2019, 2, 10), 10, 12.0, '3425241235')
(103, 'Stacy', 'Books', datetime.date(2019, 12, 25), 5, 50.0, '3425241235')
(105, 'Maria', 'T-shirts', datetime.date(2019, 5, 30), 6, 48.0, '3425241235')

In [41]:
q7="""select * from orders order by unit_price desc;""" #descending order
results=read_query(Connection,q7)
for result in results:
    print(result)

(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '3425241235')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '3425241235')
(103, 'Stacy', 'Books', datetime.date(2019, 12, 25), 5, 50.0, '3425241235')
(105, 'Maria', 'T-shirts', datetime.date(2019, 5, 30), 6, 48.0, '3425241235')
(104, 'Nancy', 'Trousers', datetime.date(2018, 7, 14), 7, 30.0, '3425241235')
(102, 'Jos', 'Laptop', datetime.date(2019, 2, 10), 10, 12.0, '3425241235')

In [43]:
from_db=[]
for result in results:
    result=list(result)
    from_db.append(result)
columns=["order_id","customer_name","product_name","date_ordered","quantity",
         "unit_price","phone_number"]
df=pd.DataFrame(from_db,columns=columns)
df

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,3425241235
1,106,Danny,Smart TV,2018-08-20,10,300.0,3425241235
2,103,Stacy,Books,2019-12-25,5,50.0,3425241235
3,105,Maria,T-shirts,2019-05-30,6,48.0,3425241235
4,104,Nancy,Trousers,2018-07-14,7,30.0,3425241235
5,102,Jos,Laptop,2019-02-10,10,12.0,3425241235

In [50]:
#update command
update="""
update orders
set unit_price=45
where order_id=103"""
connection=create_db_connection('localhost','root',pw,db_name)
results=execute_query(connection,update)
results

Mysql database connection successful
Query was successful

In [51]:
q8="""select * from orders where order_id=103"""
connection=create_db_connection('localhost','root',pw,db_name)
results=read_query(connection,q8)
for result in results:
    print(result)

Mysql database connection successful
(103, 'Stacy', 'Books', datetime.date(2019, 12, 25), 5, 45.0, '3425241235')

In [53]:
#delete command
delete_order="""delete from orders where order_id=105"""
connection=create_db_connection('localhost','root',pw,db_name)
results=execute_query(connection,delete_order)

Mysql database connection successful
Query was successful

In [54]:
q9="select*from orders;"
connection=create_db_connection('localhost','root',pw,db_name)
results=read_query(connection,q9)
for result in results:
    print(result)

Mysql database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '3425241235')
(102, 'Jos', 'Laptop', datetime.date(2019, 2, 10), 10, 12.0, '3425241235')
(103, 'Stacy', 'Books', datetime.date(2019, 12, 25), 5, 45.0, '3425241235')
(104, 'Nancy', 'Trousers', datetime.date(2018, 7, 14), 7, 30.0, '3425241235')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '3425241235')

In [ ]:
# mysql.connector.connect(host,user,pw)                                    # connect server
# cursor=connector.cursor()   curser.execute(query)                        # create database    
# mysql.connector.connect(host,user,pw,db_name)                            # use database
# curser=connection.curser()  curser.execute(query) connection.commit()    # select columns     execute query  
# curser=connection.curser()  curser.execute(query) curser.fetchall()      # read_query